; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
      acolour awood woodobj machine 
      surface treatmentstatus
      aboardsize apartsize - object
      highspeed-saw glazer grinder immersion-varnisher
      planer saw spray-varnisher - machine
      board part - woodobj)

  (:constants
              verysmooth smooth rough - surface
              varnished glazed untreated colourfragments - treatmentstatus
              natural - acolour
              small medium large - apartsize)

  (:predicates 
            (unused ?obj - part)
            (available ?obj - woodobj)

            (surface-condition ?obj - woodobj ?surface - surface)
            (treatment ?obj - part ?treatment - treatmentstatus)
            (colour ?obj - part ?colour - acolour)
            (wood ?obj - woodobj ?wood - awood)
            (boardsize ?board - board ?size - aboardsize)
            (goalsize ?part - part ?size - apartsize)
            (boardsize-successor ?size1 ?size2 - aboardsize)

            (in-highspeed-saw ?b - board ?m - highspeed-saw)
            (empty ?m - highspeed-saw)
            (has-colour ?machine - machine ?colour - acolour)
            (contains-part ?b - board ?p - part)
            (grind-treatment-change ?old ?new - treatmentstatus)
            (is-smooth ?surface - surface))
      
  (:functions (total-cost) - number
            (spray-varnish-cost ?obj - part) - number
            (glaze-cost ?obj - part) - number
            (grind-cost ?obj - part) - number
            (plane-cost ?obj - part) - number)

  (:action do-immersion-varnish
    :parameters (?x - part ?m - immersion-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and
            (increase (total-cost) 10)
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-spray-varnish
    :parameters (?x - part ?m - spray-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (spray-varnish-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-glaze
    :parameters (?x - part ?m - glazer 
                 ?newcolour - acolour)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (glaze-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x glazed)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-grind
    :parameters (?x - part ?m - grinder ?oldsurface - surface
                 ?oldcolour - acolour 
                 ?oldtreatment ?newtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (is-smooth ?oldsurface)
            (colour ?x ?oldcolour)
            (treatment ?x ?oldtreatment)
            (grind-treatment-change ?oldtreatment ?newtreatment))
    :effect (and
            (increase (total-cost) (grind-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x verysmooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x ?newtreatment)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action do-plane
    :parameters (?x - part ?m - planer ?oldsurface - surface
                 ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (treatment ?x ?oldtreatment)
            (colour ?x ?oldcolour))
    :effect (and
            (increase (total-cost) (plane-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x smooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x untreated)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action load-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (and
            (empty ?m)
            (available ?b))
    :effect (and
            (increase (total-cost) 30)
            (not (available ?b))
            (not (empty ?m))
            (in-highspeed-saw ?b ?m)))
            
  (:action unload-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (in-highspeed-saw ?b ?m)
    :effect (and
            (increase (total-cost) 10)
            (available ?b)
            (not (in-highspeed-saw ?b ?m))
            (empty ?m)))
            
  (:action cut-board-small
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p small)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-medium
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p medium)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-large
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p large)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-small
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p small)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-medium
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p medium)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-large
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p large)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))
)

; problem
; woodworking task with 11 parts and 100% wood
; Machines:
;   1 highspeed-saw
;   1 glazer
;   1 grinder
;   1 immersion-varnisher
;   1 planer
;   1 saw
;   1 spray-varnisher

(define (problem wood-prob)
  (:domain woodworking)
  (:objects
    highspeed-saw0 - highspeed-saw
    glazer0 - glazer
    grinder0 - grinder
    immersion-varnisher0 - immersion-varnisher
    planer0 - planer
    saw0 - saw
    spray-varnisher0 - spray-varnisher
    black red mauve green blue white - acolour
    pine walnut teak - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - part
    b0 b1 b2 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (empty highspeed-saw0)
    (has-colour glazer0 mauve)
    (has-colour glazer0 black)
    (has-colour glazer0 white)
    (has-colour immersion-varnisher0 natural)
    (has-colour immersion-varnisher0 black)
    (has-colour spray-varnisher0 natural)
    (has-colour spray-varnisher0 black)
    (available p0)
    (treatment p0 varnished)
    (surface-condition p0 smooth)
    (wood p0 teak)
    (colour p0 mauve)
    (goalsize p0 small)
    (= (spray-varnish-cost p0) 5)
    (= (glaze-cost p0) 10)
    (= (grind-cost p0) 15)
    (= (plane-cost p0) 10)
    (unused p1)
    (goalsize p1 medium)
    (= (spray-varnish-cost p1) 10)
    (= (glaze-cost p1) 15)
    (= (grind-cost p1) 30)
    (= (plane-cost p1) 20)
    (available p2)
    (treatment p2 varnished)
    (surface-condition p2 verysmooth)
    (wood p2 walnut)
    (colour p2 red)
    (goalsize p2 large)
    (= (spray-varnish-cost p2) 15)
    (= (glaze-cost p2) 20)
    (= (grind-cost p2) 45)
    (= (plane-cost p2) 30)
    (unused p3)
    (goalsize p3 medium)
    (= (spray-varnish-cost p3) 10)
    (= (glaze-cost p3) 15)
    (= (grind-cost p3) 30)
    (= (plane-cost p3) 20)
    (unused p4)
    (goalsize p4 large)
    (= (spray-varnish-cost p4) 15)
    (= (glaze-cost p4) 20)
    (= (grind-cost p4) 45)
    (= (plane-cost p4) 30)
    (unused p5)
    (goalsize p5 large)
    (= (spray-varnish-cost p5) 15)
    (= (glaze-cost p5) 20)
    (= (grind-cost p5) 45)
    (= (plane-cost p5) 30)
    (available p6)
    (treatment p6 varnished)
    (surface-condition p6 rough)
    (wood p6 pine)
    (colour p6 blue)
    (goalsize p6 medium)
    (= (spray-varnish-cost p6) 10)
    (= (glaze-cost p6) 15)
    (= (grind-cost p6) 30)
    (= (plane-cost p6) 20)
    (unused p7)
    (goalsize p7 small)
    (= (spray-varnish-cost p7) 5)
    (= (glaze-cost p7) 10)
    (= (grind-cost p7) 15)
    (= (plane-cost p7) 10)
    (unused p8)
    (goalsize p8 small)
    (= (spray-varnish-cost p8) 5)
    (= (glaze-cost p8) 10)
    (= (grind-cost p8) 15)
    (= (plane-cost p8) 10)
    (unused p9)
    (goalsize p9 large)
    (= (spray-varnish-cost p9) 15)
    (= (glaze-cost p9) 20)
    (= (grind-cost p9) 45)
    (= (plane-cost p9) 30)
    (unused p10)
    (goalsize p10 small)
    (= (spray-varnish-cost p10) 5)
    (= (glaze-cost p10) 10)
    (= (grind-cost p10) 15)
    (= (plane-cost p10) 10)
    (boardsize b0 s8)
    (wood b0 pine)
    (surface-condition b0 rough)
    (available b0)
    (boardsize b1 s4)
    (wood b1 teak)
    (surface-condition b1 smooth)
    (available b1)
    (boardsize b2 s4)
    (wood b2 walnut)
    (surface-condition b2 rough)
    (available b2)
  )
  (:goal
    (and
    (available p0)
    (colour p0 natural)
    (wood p0 teak)
    (surface-condition p0 smooth)
    (treatment p0 varnished)
    (available p1)
    (colour p1 black)
    (wood p1 pine)
    (surface-condition p1 smooth)
    (available p2)
    (colour p2 mauve)
    (treatment p2 glazed)
    (available p3)
    (wood p3 teak)
    (treatment p3 glazed)
    (available p4)
    (wood p4 pine)
    (surface-condition p4 smooth)
    (treatment p4 glazed)
    (available p5)
    (colour p5 black)
    (treatment p5 glazed)
    (available p6)
    (wood p6 pine)
    (surface-condition p6 smooth)
    (available p7)
    (surface-condition p7 verysmooth)
    (treatment p7 varnished)
    (available p8)
    (colour p8 black)
    (wood p8 teak)
    (surface-condition p8 verysmooth)
    (treatment p8 varnished)
    (available p9)
    (wood p9 pine)
    (treatment p9 glazed)
    (available p10)
    (colour p10 white)
    (wood p10 walnut)
    (surface-condition p10 verysmooth)
    (treatment p10 glazed)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-saw-small b2 p10 saw0 walnut rough s4 s3)
   deleted: (unused p10)
   added: (available p10) (wood p10 walnut) (surface-condition p10 rough) (colour p10 natural) (treatment p10 untreated) (boardsize b2 s3)
   goals met: 9 of 41
2. (do-saw-medium b1 p3 saw0 teak smooth s4 s3 s2)
   deleted: (unused p3)
   added: (available p3) (wood p3 teak) (surface-condition p3 smooth) (colour p3 natural) (treatment p3 untreated) (boardsize b1 s2)
   goals met: 11 of 41
3. (do-saw-medium b0 p1 saw0 pine rough s8 s7 s6)
   deleted: (unused p1)
   added: (available p1) (wood p1 pine) (surface-condition p1 rough) (colour p1 natural) (treatment p1 untreated) (boardsize b0 s6)
   goals met: 13 of 41
4. (do-saw-large b0 p4 saw0 pine rough s6 s4 s5 s3)
   deleted: (unused p4)
   added: (available p4) (wood p4 pine) (surface-condition p4 rough) (colour p4 natural) (treatment p4 untreated) (boardsize b0 s3)
   goals met: 15 of 41
5. (do-plane p4 planer0 rough natural untreated)
   deleted: (surface-condition p4 rough)
   added: (surface-condition p4 smooth)
   goals met: 16 of 41
6. (do-plane p2 planer0 verysmooth red varnished)
   deleted: (surface-condition p2 verysmooth) (treatment p2 varnished) (colour p2 red)
   added: (surface-condition p2 smooth) (treatment p2 untreated) (colour p2 natural)
   goals met: 16 of 41
7. (do-plane p10 planer0 rough natural untreated)
   deleted: (surface-condition p10 rough)
   added: (surface-condition p10 smooth)
   goals met: 16 of 41
8. (do-plane p1 planer0 rough natural untreated)
   deleted: (surface-condition p1 rough)
   added: (surface-condition p1 smooth)
   goals met: 17 of 41
9. (do-grind p10 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p10 smooth)
   added: (surface-condition p10 verysmooth)
   goals met: 18 of 41
10. (do-glaze p4 glazer0 black)
   deleted: (treatment p4 untreated) (colour p4 natural)
   added: (treatment p4 glazed) (colour p4 black)
   goals met: 19 of 41
11. (do-glaze p3 glazer0 black)
   deleted: (treatment p3 untreated) (colour p3 natural)
   added: (treatment p3 glazed) (colour p3 black)
   goals met: 20 of 41
12. (do-glaze p2 glazer0 mauve)
   deleted: (treatment p2 untreated) (colour p2 natural)
   added: (treatment p2 glazed) (colour p2 mauve)
   goals met: 22 of 41
13. (do-glaze p10 glazer0 white)
   deleted: (treatment p10 untreated) (colour p10 natural)
   added: (treatment p10 glazed) (colour p10 white)
   goals met: 24 of 41
14. (do-glaze p1 glazer0 black)
   deleted: (treatment p1 untreated) (colour p1 natural)
   added: (treatment p1 glazed) (colour p1 black)
   goals met: 25 of 41
15. (do-plane p0 planer0 smooth mauve varnished)
   deleted: (treatment p0 varnished) (colour p0 mauve)
   added: (treatment p0 untreated) (colour p0 natural)
   goals met: 25 of 41
16. (do-immersion-varnish p0 immersion-varnisher0 natural smooth)
   deleted: (treatment p0 untreated)
   added: (treatment p0 varnished)
   goals met: 26 of 41
17. (do-plane p6 planer0 rough blue varnished)
   deleted: (surface-condition p6 rough) (treatment p6 varnished) (colour p6 blue)
   added: (surface-condition p6 smooth) (treatment p6 untreated) (colour p6 natural)
   goals met: 27 of 41
18. (do-saw-large b0 p9 saw0 pine rough s3 s1 s2 s0)
   deleted: (unused p9)
   added: (available p9) (wood p9 pine) (surface-condition p9 rough) (colour p9 natural) (treatment p9 untreated) (boardsize b0 s0)
   goals met: 29 of 41
19. (do-glaze p9 glazer0 black)
   deleted: (treatment p9 untreated) (colour p9 natural)
   added: (treatment p9 glazed) (colour p9 black)
   goals met: 30 of 41
20. (do-saw-large b2 p5 saw0 walnut rough s3 s1 s2 s0)
   deleted: (unused p5)
   added: (available p5) (wood p5 walnut) (surface-condition p5 rough) (colour p5 natural) (treatment p5 untreated) (boardsize b2 s0)
   goals met: 31 of 41
21. (do-glaze p5 glazer0 black)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 glazed) (colour p5 black)
   goals met: 33 of 41
22. (do-saw-small b1 p7 saw0 teak smooth s2 s1)
   deleted: (unused p7)
   added: (available p7) (wood p7 teak) (surface-condition p7 smooth) (colour p7 natural) (treatment p7 untreated) (boardsize b1 s1)
   goals met: 34 of 41
23. (do-grind p7 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p7 smooth)
   added: (surface-condition p7 verysmooth)
   goals met: 35 of 41
24. (do-immersion-varnish p7 immersion-varnisher0 black verysmooth)
   deleted: (treatment p7 untreated) (colour p7 natural)
   added: (treatment p7 varnished) (colour p7 black)
   goals met: 36 of 41
25. (do-saw-small b1 p8 saw0 teak smooth s1 s0)
   deleted: (unused p8)
   added: (available p8) (wood p8 teak) (surface-condition p8 smooth) (colour p8 natural) (treatment p8 untreated) (boardsize b1 s0)
   goals met: 38 of 41
26. (do-grind p8 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p8 smooth)
   added: (surface-condition p8 verysmooth)
   goals met: 39 of 41
27. (do-immersion-varnish p8 immersion-varnisher0 black verysmooth)
   deleted: (treatment p8 untreated) (colour p8 natural)
   added: (treatment p8 varnished) (colour p8 black)
   goals met: 41 of 41
